In [5]:
''' 두 DataFrame 병합하기 
행렬 순인데 왜 열이 먼저 나오는 key 값에 있나요?
딕셔너리의 key값에는 리스트가 올 수 없고 우리는 열로 행렬을 분석하는데 익숙하기 때문이다 '''
import pandas as pd
df1 = pd.DataFrame({
    "A":["A0","B1","C2","D3"],
    "B":["A0","B1","C2","D3"],
    "C":["A0","B1","C2","D3"],
    "D":["A0","B1","C2","D3"]
}, index = [0,1,2,3])
df2 = pd.DataFrame({
    "A":["A4","B5","C6","D7"],
    "B":["A4","B5","C6","D7"],
    "C":["A4","B5","C6","D7"],
    "D":["A4","B5","C6","D7"]
}, index = [4,5,6,7])
df3 = pd.DataFrame({
    "A":["A8","B9","C10","D11"],
    "B":["A8","B9","C10","D11"],
    "C":["A8","B9","C10","D11"],
    "D":["A8","B9","C10","D11"]
}, index = [8,9,10,11])
print(df1)
print(df2)
df3

    A   B   C   D
0  A0  A0  A0  A0
1  B1  B1  B1  B1
2  C2  C2  C2  C2
3  D3  D3  D3  D3
    A   B   C   D
4  A4  A4  A4  A4
5  B5  B5  B5  B5
6  C6  C6  C6  C6
7  D7  D7  D7  D7

      A    B    C    D
8    A8   A8   A8   A8
9    B9   B9   B9   B9
10  C10  C10  C10  C10
11  D11  D11  D11  D11

In [6]:
result = pd.concat([df1,df2,df3]) # Concaternate 사슬처럼 잇다(열방향)
print(result)

result = pd.concat([df1,df2,df3], keys = ['x','y','z']) # Keys 옵션으로 구분 한 번 더 할 수 있다
                                                        # 이렇게 만들어진 key는 계층적 인덱스가 되어
                                                        # 튜플을 원소로 가지는 level을 만든다.
''' 계층적 인덱스(Multi Index) - 정렬함수
'''

result.index

      A    B    C    D
0    A0   A0   A0   A0
1    B1   B1   B1   B1
2    C2   C2   C2   C2
3    D3   D3   D3   D3
4    A4   A4   A4   A4
5    B5   B5   B5   B5
6    C6   C6   C6   C6
7    D7   D7   D7   D7
8    A8   A8   A8   A8
9    B9   B9   B9   B9
10  C10  C10  C10  C10
11  D11  D11  D11  D11

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [9]:
print(result.index.get_level_values(0)) ''' 0층 인덱스 '''
result.index.get_level_values(1) ''' 1층 인덱스 '''

SyntaxError: invalid syntax (<ipython-input-9-4007976def51>, line 1)

In [17]:
df4 = pd.DataFrame({
    "B":["B2","B3","B6","B7"],
    "D":["D2","D3","D6","D7"],
    "F":["F2","F3","F6","F7"]
}, index = [2,3,6,7])

result = pd.concat([df1,df4] , axis = 1)
print(result)
''' concat은 index를 기준으로 데이터를 합치기 때문에, 빈 인덱스에는 NaN이 들어간다.
이 때 겹친 Index만 가져오고 NaN이 들어가게 만드는 겹치지 않은 Index는 버리게 하는 옵션이
join = 'inner'
'''
result_2 = pd.concat([df1,df4],axis = 1, join = 'inner')
result_2

     A    B    C    D    B    D    F
0   A0   A0   A0   A0  NaN  NaN  NaN
1   B1   B1   B1   B1  NaN  NaN  NaN
2   C2   C2   C2   C2   B2   D2   F2
3   D3   D3   D3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

    A   B   C   D   B   D   F
2  C2  C2  C2  C2  B2  D2  F2
3  D3  D3  D3  D3  B3  D3  F3

In [18]:
left = pd.DataFrame({
    'key':['K0','K1','K2','K3'],
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']
})
right = pd.DataFrame({
    'key':['K0','K1','K2','K3'],
    'C':['A0','A1','A2','A3'],
    'D':['B0','B1','B2','B3']
})

In [19]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [25]:
right

  key   C   D
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [28]:
'''
공통으로 있는 컬럼인 key를 기준으로 merge 명령에서 merge 기준을 설정하는 옵션으로
on 옵션을 선택할 수 있습니다.
'''
pd.merge(left,right, on ='key')
'''
how 옵션으로 두 데이터에서 기준이 무엇이 되어야 할 지를 정할 수도 있습니다.
how = '데이터프레임 이름'

또 NaN을 무시하고 결과를 모두 표기하게 히려면 how = 'outer' 를 쓰면 됩니다.
반대로 how = 'inner' 도 있겠죠?
'''
pd.merge(left,right,how='left',on = 'key')

  key   A   B   C   D
0  K0  A0  B0  A0  B0
1  K1  A1  B1  A1  B1
2  K2  A2  B2  A2  B2
3  K3  A3  B3  A3  B3